---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayersError
source: html/6ff66df6-f76c-35b2-69d9-9438ca5d4359.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayersError Property

Cannot create wall - its layers would degenerate or. Reduce the wall's height or slant.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayersError { get; }
```